Revit 2027 API
BuiltInFailures.MEPFabricationFailures.GroupedFabricationPartNotReposition Property
 Failed to reposition part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GroupedFabricationPartNotReposition { get; }
Public Shared ReadOnly Property GroupedFabricationPartNotReposition As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GroupedFabricationPartNotReposition {
	FailureDefinitionId^ get ();
}
static member GroupedFabricationPartNotReposition : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace